Revit 2027 API
ParameterTypeId.StructuralFloorAnalyzesAs Property
 "Analyze As"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralFloorAnalyzesAs { get; }
Public Shared ReadOnly Property StructuralFloorAnalyzesAs As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralFloorAnalyzesAs {
	ForgeTypeId^ get ();
}
static member StructuralFloorAnalyzesAs : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace